app/controllers/events_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `users`
---
  def set_user(user_id)
    user_id = 1 unless !user_id.nil?
    @user = User.find(user_id)
    @users = User.find :all

SELECT * FROM `events` WHERE (`events`.`id` = 1)
---
  def edit
    @users = User.find :all
    @event = Event.find(params[:id])

INSERT INTO `events` (`name`, `created_at`, `week`, `starts_at`, `updated_at`, `day_name`, `ends_at`, `day`, `min`, `description`, `hours`) VALUES('Meet with steve', '2009-05-30 20:14:55', NULL, '2009-05-30 20:13:00', '2009-05-30 20:14:55', NULL, NULL, NULL, 0, 'hello world', 1)
---
  def create
    @users = User.find :all
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT * FROM `events` WHERE (`events`.`id` = 10)
UPDATE `events` SET `updated_at` = '2009-06-01 02:12:09', `starts_at` = '2009-05-28 10:51:00', `minutes` = 0, `ends_at` = '2009-05-28 11:51:00', `day` = 148 WHERE `id` = 9
---
  def update
    @users = User.find :all
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])