app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `created_at`, `updated_at`) VALUES('Dan McGrady', '2009-05-31 04:02:30', '2009-05-31 04:02:30')